Revit 2027 API
BuiltInFailures.PartMakerMethodForWallFailures.CouldNotCreateWallPartDueToWallJoin Property
 Failed to create basic layer geometry due to an excessively short edge created by wall join.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouldNotCreateWallPartDueToWallJoin { get; }
Public Shared ReadOnly Property CouldNotCreateWallPartDueToWallJoin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouldNotCreateWallPartDueToWallJoin {
	FailureDefinitionId^ get ();
}
static member CouldNotCreateWallPartDueToWallJoin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForWallFailures Class
Autodesk.Revit.DB Namespace